# Close Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
IFCFile..::..Close Method
IFCFile Class See Also
---
Close the IFC file.
**Namespace:** Autodesk.Revit.DB.IFC**Assembly:** RevitAPIIFC (in RevitAPIIFC.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public void Close()
```

Visual Basic
---
```text
Public Sub Close
```

Visual C++
---
```text
public:
void Close()
```

# See Also
IFCFile Class
Autodesk.Revit.DB.IFC Namespace